{
  "navbar.item.1.label": "Home",
  "navbar.item.1.hint": "Home",
  "navbar.item.2.label": "Projects",
  "navbar.item.2.hint": "Projects",
  "navbar.item.3.label": "Skills",
  "navbar.item.3.hint": "Skills",
  "navbar.item.4.label": "About Me",
  "navbar.item.4.hint": "About Me",
  "navbar.item.5.label": "Contact",
  "navbar.item.5.hint": "Contact",
  "navbar.item.language.hint": "Change Language",
  "navbar.item.menu.hint": "Menu",
  "hero.item.1.label": "Hi, my name is João, but you can call me John",
  "hero.title": "Fullstack Developer",
  "hero.item.2.label": "Specialist in creating complete digital solutions, from intuitive interfaces to robust systems. With 6 years transforming challenges into efficient code and memorable experiences.",
  "hero.button.1.text": "View my work",
  "hero.button.1.hint": "View my work",
  "hero.button.2.text": "Download Resume",
  "hero.button.2.hint": "Download Resume",
  "stats.item.1.label": "Years of Experience",
  "stats.item.2.label": "Years of Study",
  "stats.item.3.label": "Certificates Earned",
  "stats.item.4.label": "Personal Projects",
  "projects.title": "Projects",
  "projects.text": "Below you’ll find my experiments and solutions built beyond the corporate environment. Each project here represents an opportunity to apply emerging technologies, test development best practices, and solve real-world problems through innovation.<1/><1/>These works reflect my passion for turning ideas into functional code. All are publicly available for collaboration and study.",
  "projects.button.1.hint": "Previous",
  "projects.button.2.hint": "Next",
  "projects.modal.close.hint": "Close",
  "projects.modal.features.label": "Features",
  "projects.modal.viewCode.label": "Source Code",
  "projects.modal.viewDemo.label": "Live Demo",
  "projects.modal.technologies.label": "Technologies",
  "projects.modal.previous.hint": "Previous",
  "projects.modal.next.hint": "Next",
  "projects.modal.goToImage.hint": "Go to image",
  "projects.retrocode.description": "Archive of academic projects.",
  "projects.retrocode.text": "Retro-Code is a collection of simple scripts I developed during high school. These scripts are programming projects that reflect my progress from that time.",
  "projects.retrocode.feat.1.label": "Initial programming logic learning",
  "projects.retrocode.feat.2.label": "Study documentation",
  "projects.retrocode.feat.3.label": "Knowledge improvement",
  "projects.storiesmaker.description": "Automated tool for creating social media stories videos",
  "projects.storiesmaker.text": "Grails API that automates video editing for stories, with dynamic text insertion, transitions and template system. For creating short videos, reels, stories, etc.",
  "projects.storiesmaker.features.1.label": "Automatic video editing and processing",
  "projects.storiesmaker.features.2.label": "Text insertion with dynamic animations",
  "projects.storiesmaker.features.3.label": "Customizable template system",
  "projects.storiesmaker.features.4.label": "Configurable video length/duration",
  "projects.pln.title": "Sentiment Analysis in Python",
  "projects.pln.description": "Sentiment analysis system using NLP techniques",
  "projects.pln.text": "Project developed for the Special Topics course in Information Security college. Analyzes posts to identify which APT (Advanced Persistent Threat) may have made them and their potential targets, using natural language processing on a specialized corpus.",
  "projects.pln.features.1.label": "Text preprocessing with NLTK (tokenization, stopwords)",
  "projects.pln.features.2.label": "Tweet search",
  "projects.pln.features.3.label": "APT identification",
  "projects.pln.features.4.label": "Target identification",
  "projects.pln.features.5.label": "Attack identification",
  "projects.pln.features.6.label": "Graphs",
  "projects.cve.title": "CVE and CVSS Identifier",
  "projects.cve.description": "Tool for CVE vulnerability analysis and CVSS score calculation",
  "projects.cve.text": "Project developed at Information Security college. System that identifies vulnerabilities (CVE) and calculates risk metrics (CVSS) with impact details.",
  "projects.cve.features.1.label": "CVE vulnerability database query",
  "projects.cve.features.2.label": "Automatic CVSS v3.1 score calculation",
  "projects.cve.features.3.label": "Detailed attack vector analysis (Attack Vector, Complexity, Privileges, etc)",
  "projects.cve.features.4.label": "Formatted output with critical risk analysis information",
  "projects.certverify.title": "Digital Certificate Validator",
  "projects.certverify.description": "X.509 standard digital certificate validation tool",
  "projects.certverify.text": "Project developed at Information Security college. System for verifying digital certificates, including validity, trust chain and revocation status.",
  "projects.certverify.features.1.label": "X.509 format certificate validation",
  "projects.certverify.features.2.label": "Certificate chain verification",
  "projects.certverify.features.3.label": "Revocation list checking (CRL/OCSP)",
  "projects.certverify.features.4.label": "Certificate metadata and information analysis",
  "projects.johnswallet.description": "Personal finance management application developed in Springboot",
  "projects.johnswallet.text": "Digital wallet for expense and income control.",
  "projects.johnswallet.features.1.label": "Financial transaction registration (income and expenses)",
  "projects.johnswalletmsg.description": "Messaging system for financial control application.",
  "projects.johnswalletmsg.text": "Communication module that notifies debtors of their debts.",
  "projects.johnswalletmsg.features.1.label": "Email notification",
  "projects.johnswalletmsg.features.2.label": "SMS notification",
  "skills.title": "Skills",
  "skills.text": "My skills are organized by specialty, enabling strategic work across each development layer. Each card details years of experience, implementation complexity, and real-world use cases — and can be filtered by skill type (backend, frontend, etc.) for personalized navigation.",
  "skill.button.showless.text": "Show less",
  "skills.tabs.item.1.label": "All",
  "skills.tabs.item.2.label": "Backend",
  "skills.tabs.item.3.label": "Frontend",
  "skills.tabs.item.4.label": "Database",
  "skills.tabs.item.5.label": "Repository",
  "skills.tabs.item.6.label": "DevOps",
  "skills.java.text": "I have solid experience in Java development, using frameworks such as Spring Boot and Grails to build robust and scalable applications. I have worked on projects involving microservices, authentication (JWT and OAuth), messaging, and integration with relational and non-relational databases.",
  "skills.javascript.text": "I have experience with JavaScript on both the frontend and backend. On the frontend, I have worked with frameworks such as ExtJS and React.js, developing dynamic and responsive interfaces. On the backend, I have used JavaScript to build APIs and automated scripts.",
  "skills.cpp.text": "My knowledge of C++ comes from academic projects and programming challenges, particularly in the field of algorithms and data structures. I have used the language for application development and custom solutions.",
  "skills.python.text": "I have experience with Python for task automation, data analysis, and crawler development. I have also used the language for experiments in machine learning and cybersecurity.",
  "skills.html.text": "I have extensive knowledge of HTML for structuring semantic and SEO-optimized web pages, ensuring accessibility and compatibility across different devices.",
  "skills.css.text": "I have experience using CSS and frameworks such as Tailwind CSS to style modern, responsive, and high-performance interfaces.",
  "skills.oracle.text": "I have worked with Oracle SQL in corporate systems, performing complex queries, query optimization, and creating and maintaining packages and procedures in large-scale applications.",
  "skills.postgresql.text": "I have hands-on experience with PostgreSQL, including configuration and data modeling.",
  "skills.git.text": "I use Git daily for version control and team collaboration, following best practices such as Git Flow and commit conventions. I was responsible for standardizing Git usage at a company I worked for, establishing guidelines for branches, commits, and code reviews, ensuring greater organization and efficiency in development.",
  "skills.tortoisesvn.text": "I had experience with Tortoise SVN for version control before adopting Git. I was responsible for leading the migration from SVN to GitLab at a company I worked for, ensuring the preservation of commit history and training the team on the new tool for a smooth and efficient transition.",
  "skills.gradle.text": "I have used Gradle for build automation in Java and Groovy projects, configuring efficient pipelines for compiling, testing, and deploying applications.",
  "skills.maven.text": "I have experience with Maven for dependency management and Java project builds, ensuring reproducibility and integration with other CI/CD tools.",
  "skills.gitlabcicd.text": "I have implemented CI/CD pipelines in GitLab to automate testing, builds, and deployments, ensuring efficiency in the development workflow and continuous delivery.",
  "skills.jenkins.text": "I worked with Jenkins for automating builds, tests, and deployments. However, the company I worked for decided to migrate its entire CI/CD infrastructure to GitLab CI/CD, and I was responsible for leading this transition. This involved configuring pipelines in GitLab, adapting automation scripts, and training the team to ensure a more integrated and efficient development flow.",
  "skills.docker.text": "I have experience with Docker for application containerization, creating isolated environments, using it in automated testing, and deploying applications.",
  "skills.rabbitmq.text": "My knowledge of RabbitMQ comes from personal projects where I explored concepts of asynchronous messaging for communication between distributed services. I have worked on configuring exchanges, queues, and consumers, ensuring efficient message delivery and the scalability of the systems I developed.",
  "skills.springboot.text": "I have 5 years of professional experience with Spring Boot, having worked on various projects, including the complete revamp of my company's authentication system. I have implemented RESTful APIs, security with JWT and OAuth, database integrations, and messaging, as well as performance optimizations to ensure scalability and stability.",
  "skills.extjs.text": "I have 6 years of professional experience with ExtJS, where I was responsible for migrating framework versions and separating frontend and backend into distinct projects. I actively participated in modernizing the company's tech stack, ensuring better code maintainability and enhancing user experience.",
  "skills.grails.text": "I also have 6 years of professional experience with Grails, having worked on several significant projects. I developed a platform for asynchronous report execution, participated in migrating a monolithic system to microservices, and led the complete revamp of systems and authentication. My experience includes complex integrations, performance optimizations, and application security enhancements.",
  "skills.react.text": "My knowledge of ReactJS comes from personal projects where I developed interactive and responsive applications. I have worked with reusable components, state management, and API integrations, as well as exploring concepts such as hooks and the context API.",
  "skills.tailwind.text": "I have used Tailwind CSS in personal projects for efficient and modern interface styling. Its utility-based approach allowed me to create flexible and responsive layouts quickly, ensuring a consistent and adaptable visual experience.",
  "about.title": "About Me",
  "about.text": "I am a full-stack developer with solid experience in Java and JavaScript, specializing in the Grails and Spring Boot ecosystem, as well as frameworks like ExtJS. I have a strong background in cybersecurity and secure development, along with experience in Docker, CI/CD, SQL databases, and messaging systems. My career has been marked by complex system migrations, restructuring of legacy architectures, and optimizing applications for greater scalability and security.<1/><1/>I was responsible for standardizing Git usage at a company I worked for and migrating repositories from SVN to GitLab, modernizing the versioning and collaboration workflow between teams. Additionally, I led the migration of Jenkins pipelines to GitLab CI/CD, optimizing continuous delivery and increasing development efficiency.<1/><1/>I have 6 years of experience with Grails, playing a key role in the complete revamp of legacy systems, the separation of backend and frontend into distinct projects, and the migration of a monolithic system to a microservices-based architecture. I also developed a platform for asynchronous report execution, ensuring scalability and efficiency in data generation.<1/><1/>In the security field, I was responsible for the complete overhaul of the authentication system for company applications, implementing best practices to strengthen system protection.<1/><1/>Currently, I am expanding my portfolio with projects involving JWT, OAuth, Kafka, RabbitMQ, gRPC, and other modern technologies, exploring scalable solutions, efficient communication between services, and high-performance distributed systems.<1/><1/>I am passionate about technical challenges, software engineering, and best programming practices. My goal is to develop robust, efficient, and secure systems, balancing performance, scalability, and security.<1/><1/>Below, you can find links to my professional profiles.",
  "contact.title": "Contact Me",
  "contact.text": "If you’d like to get in touch, I’d be happy to chat! Whether it’s for job opportunities, freelance projects, or just to exchange ideas about technology and software development, I’m available.<1/><1/>You can reach me through the links below or send me a direct message. I’ll respond as soon as possible!",
  "contact.form.title": "Contact Form",
  "contact.form.name.label": "Full Name",
  "contact.form.name.hint": "Full Name",
  "contact.form.email.label": "E-mail",
  "contact.form.email.hint": "E-mail",
  "contact.form.message.label": "Message",
  "contact.form.message.hint": "Message",
  "contact.form.submit.label": "Submit",
  "contact.form.submit.hint": "Submit",
  "footer.copyright": "João Gabriel Hartmann. All rights reserved.",
  "footer.using": "Developed with React and Tailwind CSS"
}
