{
  "navbar.item.1.label": "Home",
  "navbar.item.1.hint": "Home",
  "navbar.item.2.label": "Projects",
  "navbar.item.2.hint": "Projects",
  "navbar.item.3.label": "Skills",
  "navbar.item.3.hint": "Skills",
  "navbar.item.4.label": "About Me",
  "navbar.item.4.hint": "About Me",
  "navbar.item.5.label": "Contact",
  "navbar.item.5.hint": "Contact",
  "navbar.item.language.hint": "Change Language",
  "navbar.item.menu.hint": "Menu",
  "hero.item.1.label": "Hi, my name is João, but you can call me John",
  "hero.title": "Fullstack Developer",
  "hero.item.2.label": "Specialist in creating complete digital solutions, from intuitive interfaces to robust systems. With 6 years transforming challenges into efficient code and memorable experiences.",
  "hero.button.1.text": "View my work",
  "hero.button.1.hint": "View my work",
  "hero.button.2.text": "Download Resume",
  "hero.button.2.hint": "Download Resume",
  "stats.item.1.label": "Years of Experience",
  "stats.item.2.label": "Years of Study",
  "stats.item.3.label": "Certificates Earned",
  "stats.item.4.label": "Personal Projects",
  "projects.title": "Projects",
  "projects.text": "Below you’ll find my experiments and solutions built beyond the corporate environment. Each project here represents an opportunity to apply emerging technologies, test development best practices, and solve real-world problems through innovation.<1/><1/>These works reflect my passion for turning ideas into functional code. All are publicly available for collaboration and study.",
  "projects.button.1.hint": "Previous",
  "projects.button.2.hint": "Next",
  "skills.title": "Skills",
  "skills.text": "My skills are organized by specialty, enabling strategic work across each development layer. Each card details years of experience, implementation complexity, and real-world use cases — and can be filtered by skill type (backend, frontend, etc.) for personalized navigation.",
  "skills.tabs.item.1.label": "All",
  "skills.tabs.item.2.label": "Backend",
  "skills.tabs.item.3.label": "Frontend",
  "skills.tabs.item.4.label": "Database",
  "skills.tabs.item.5.label": "Repository",
  "skills.tabs.item.6.label": "DevOps",
  "about.title": "About Me",
  "about.text": "I am a fullstack developer with experience in Java and JavaScript, specializing in the Grails and Spring Boot ecosystem, and also in frameworks like ExtJS. I have a strong background in information security and secure development practices, along with experience in Docker, CI/CD, SQL databases, and messaging systems. I constantly seek to improve my skills and explore new technologies, with a particular interest in microservices, messaging, and scalable solutions.<1/><1/>Currently, I am expanding my portfolio with projects involving JWT, OAuth, Kafka, RabbitMQ, gRPC, and other modern technologies. I have experience in developing enterprise applications as well as creating automation and efficiency-driven solutions.<1/><1/>I am passionate about technical challenges, software engineering, and best programming practices. My goal is to develop robust and efficient systems while ensuring performance and security.<1/><1/>Below, you can find links to my professional profiles.",
  "contact.title": "Contact Me",
  "contact.text": "If you’d like to get in touch, I’d be happy to chat! Whether it’s for job opportunities, freelance projects, or just to exchange ideas about technology and software development, I’m available.<1/><1/>You can reach me through the links below or send me a direct message. I’ll respond as soon as possible!",
  "contact.form.title": "Contact Form",
  "contact.form.name.label": "Full Name",
  "contact.form.name.hint": "Full Name",
  "contact.form.email.label": "E-mail",
  "contact.form.email.hint": "E-mail",
  "contact.form.message.label": "Message",
  "contact.form.message.hint": "Message",
  "contact.form.submit.label": "Submit",
  "contact.form.submit.hint": "Submit"
}
