{
  "navbar.item.1.label": "Home",
  "navbar.item.1.hint": "Home",
  "navbar.item.2.label": "Projetos",
  "navbar.item.2.hint": "Projetos",
  "navbar.item.3.label": "Habilidades",
  "navbar.item.3.hint": "Habilidades",
  "navbar.item.4.label": "Sobre",
  "navbar.item.4.hint": "Sobre",
  "navbar.item.5.label": "Contato",
  "navbar.item.5.hint": "Contato",
  "navbar.item.language.hint": "Trocar Idioma",
  "navbar.item.menu.hint": "Menu",
  "hero.item.1.label": "Oi, meu nome é João",
  "hero.title": "Desenvolvedor Fullstack",
  "hero.item.2.label": "Especialista em criar soluções digitais completas, desde interfaces intuitivas até sistemas robustos. Com 6 anos transformando desafios em código eficiente e experiências memoráveis.",
  "hero.button.1.text": "Veja meu trabalho",
  "hero.button.1.hint": "Veja meu trabalho",
  "hero.button.2.text": "Baixe o currículo",
  "hero.button.2.hint": "Baixe o currículo",
  "stats.item.1.label": "Anos de Experiência",
  "stats.item.2.label": "Anos de Estudo",
  "stats.item.3.label": "Certificados Obtidos",
  "stats.item.4.label": "Projetos Pessoais",
  "projects.title": "Projetos",
  "projects.text": "Abaixo é possível ver meus experimentos e soluções criadas além do ambiente corporativo. Cada projeto aqui representa uma oportunidade de aplicar tecnologias emergentes, testar boas práticas de desenvolvimento e resolver problemas do mundo real de forma inovadora.<1/><1/>Esses trabalhos refletem minha paixão por transformar ideias em código funcional. Todos estão disponíveis publicamente para colaboração e estudo.",
  "projects.button.1.hint": "Anterior",
  "projects.button.2.hint": "Próximo",
  "projects.modal.close.hint": "Fechar",
  "projects.modal.features.label": "Features",
  "projects.modal.viewCode.label": "Código Fonte",
  "projects.modal.viewDemo.label": "Live Demo",
  "projects.modal.technologies.label": "Tecnologias",
  "projects.modal.previous.hint": "Anterior",
  "projects.modal.next.hint": "Próximo",
  "projects.modal.goToImage.hint": "Ir para a imagem",
  "projects.retrocode.description": "Arquivo de projetos acadêmicos.",
  "projects.retrocode.text": "Retro-Code é uma coleção de scripts simples que desenvolvi durante o período de ensino médio. Esses scripts são projetos de programação que refletem meu progresso daquela época.",
  "projects.retrocode.feat.1.label": "Aprendizado inicial de lógica de programação",
  "projects.retrocode.feat.2.label": "Documentação de estudos",
  "projects.retrocode.feat.3.label": "Aprimoramento de conhecimento",
  "projects.storiesmaker.description": "Ferramenta automatizada para criar vídeos de stories para redes sociais",
  "projects.storiesmaker.text": "API em Grails que automatiza a edição de vídeos para stories, com inserção dinâmica de textos, transições e sistema de templates. Para criar videos curtos, reels, stories, etc.",
  "projects.storiesmaker.feat.1.label": "Edição e processamento automático de vídeos",
  "projects.storiesmaker.feat.2.label": "Inserção de textos com animações dinâmicas",
  "projects.storiesmaker.feat.3.label": "Sistema de templates personalizáveis",
  "projects.storiesmaker.feat.4.label": "Tamanho/tempo de vídeo configurável",
  "projects.pln.title": "Análise de Sentimentos em Python",
  "projects.pln.description": "Sistema de análise de sentimentos com técnicas de PLN",
  "projects.pln.text": "Projeto desenvolvido para a cadeira de Tópicos Especiais na faculdade de Segurança da Informação. Analisa posts para identificar qual APT (Advanced Persistent Threat) pode tê-los realizado e seus possíveis alvos, utilizando processamento de linguagem natural sobre um corpus especializado.",
  "projects.pln.features.1.label": "Pré-processamento de texto com NLTK (tokenização, stopwords)",
  "projects.pln.features.2.label": "Busca de Tweets",
  "projects.pln.features.3.label": "Identificação de APTs",
  "projects.pln.features.4.label": "Identificação de alvos",
  "projects.pln.features.5.label": "Identificação de ataques",
  "projects.pln.features.6.label": "Gráficos",
  "projects.cve.title": "Identificador de CVEs e CVSS",
  "projects.cve.description": "Ferramenta para análise de vulnerabilidades CVE e cálculo de scores CVSS",
  "projects.cve.text": "Projeto desenvolvido na faculdade de Segurança da Informação. Sistema que identifica vulnerabilidades (CVE) e calcula métricas de risco (CVSS) com detalhamento de impactos.",
  "projects.cve.features.1.label": "Consulta à base de dados de vulnerabilidades CVE",
  "projects.cve.features.2.label": "Cálculo automático de scores CVSS v3.1",
  "projects.cve.features.3.label": "Análise detalhada dos vetores de ataque (Attack Vector, Complexity, Privileges, etc)",
  "projects.cve.features.4.label": "Saída formatada com informações críticas para análise de risco",
  "projects.certverify.title": "Validador de Certificados Digitais",
  "projects.certverify.description": "Ferramenta de validação de certificados digitais no padrão X.509",
  "projects.certverify.text": "Projeto desenvolvido na faculdade de Segurança da Informação. Sistema para verificação de certificados digitais, incluindo validade, cadeia de confiança e status de revogação.",
  "projects.certverify.features.1.label": "Validação de certificados no formato X.509",
  "projects.certverify.features.2.label": "Verificação de cadeia de certificação (certificate chain)",
  "projects.certverify.features.3.label": "Checagem de listas de revogação (CRL/OCSP)",
  "projects.certverify.features.4.label": "Análise de metadados e informações do certificado",
  "projects.johnswallet.description": "Aplicativo de gestão financeira pessoal desenvolvido em Springboot",
  "projects.johnswallet.text": "Carteira digital para controle de gastos e receitas.",
  "projects.johnswallet.features.1.label": "Cadastro de transações financeiras (receitas e despesas)",
  "projects.johnswalletmsg.description": "Sistema de mensagens para aplicação de controle financeiro.",
  "projects.johnswalletmsg.text": "Módulo de comunicação que notifica devedores de seus débitos.",
  "projects.johnswalletmsg.features.1.label": "Notificação via e-mail",
  "projects.johnswalletmsg.features.2.label": "Notificação via SMS",
  "skills.title": "Habilidades",
  "skills.text": "Minhas competências são organizadas por especialidade, permitindo atuação estratégica em cada camada do desenvolvimento. Cada card detalha anos de experiência, complexidade de implementação e casos de uso real — e podem ser filtradas por tipo de habilidade (backend, frontend, etc.) para uma navegação personalizada.",
  "skills.tabs.item.1.label": "Todas",
  "skills.tabs.item.2.label": "Backend",
  "skills.tabs.item.3.label": "Frontend",
  "skills.tabs.item.4.label": "Banco de Dados",
  "skills.tabs.item.5.label": "Repositórios",
  "skills.tabs.item.6.label": "DevOps",
  "skills.java.text": "Possuo sólida experiência em desenvolvimento com Java, utilizando frameworks como Spring Boot e Grails para construção de aplicações robustas e escaláveis. Trabalhei em projetos que envolvem microsserviços, autenticação (JWT e OAuth), mensageria e integração com bancos de dados relacionais e não relacionais.",
  "skills.javascript.text": "Tenho experiência com JavaScript tanto no frontend quanto no backend. No frontend, trabalhei com frameworks como ExtJS e React.js, desenvolvendo interfaces dinâmicas e responsivas. No backend, usei JavaScript para construir APIs e scripts automatizados.",
  "skills.cpp.text": "Meu conhecimento em C++ vem de projetos acadêmicos e desafios de programação, especialmente na área de algoritmos e estruturas de dados. Utilizei a linguagem para desenvolvimento de aplicações e soluções própias.",
  "skills.python.text": "Tenho experiência com Python para automação de tarefas, análise de dados e desenvolvimento de crawlers. Também utilizei a linguagem para experimentos em machine learning e segurança da informação.",
  "skills.html.text": "Possuo amplo conhecimento em HTML para estruturação de páginas web semânticas e otimizadas para SEO, garantindo acessibilidade e compatibilidade com diferentes dispositivos.",
  "skills.css.text": "Tenho experiência no uso de CSS e frameworks como Tailwind CSS para estilização de interfaces modernas, responsivas e de alto desempenho.",
  "skills.oracle.text": "Trabalhei com Oracle SQL em sistemas corporativos, realizando consultas complexas, otimização de queries, criação e manutenção de packages e procedures em aplicações de grande escala.",
  "skills.postgresql.text":  "Tenho experiência prática com PostgreSQL, incluindo configuração e modelagem de dados.",
  "skills.git.text": "Utilizo Git diariamente para controle de versão e colaboração em equipe, seguindo boas práticas como Git Flow e convenções de commit. Fui responsável pela padronização do uso do Git em uma empresa que trabalhei, estabelecendo diretrizes para branches, commits e code reviews, garantindo maior organização e eficiência no desenvolvimento.",
  "skills.tortoisesvn.text":  "Tive experiência com Tortoise SVN para controle de versão antes da adoção do Git. Fui responsável por conduzir a migração do repositório SVN para o GitLab em uma empresa que trabalhei, garantindo a preservação do histórico de commits e treinando a equipe na nova ferramenta para uma transição suave e eficiente.",
  "skills.gradle.text": "Utilizei Gradle para automação de build em projetos Java e Groovy, configurando pipelines eficientes para compilar, testar e implantar aplicações.",
  "skills.maven.text":  "Tenho experiência com Maven para gerenciamento de dependências e build de projetos Java, garantindo reprodutibilidade e integração com outras ferramentas de CI/CD.",
  "skills.gitlabcicd.text": "Implementei pipelines de CI/CD no GitLab para automação de testes, builds e deploys, garantindo eficiência no fluxo de desenvolvimento e entrega contínua.",
  "skills.jenkins.text":  "Trabalhei com Jenkins para a automação de builds, testes e deploys. No entanto, a empresa que eu trabalhava decidiu migrar toda a infraestrutura de CI/CD para o GitLab CI/CD, e fui responsável por liderar essa transição. Isso envolveu a configuração de pipelines no GitLab, adaptação dos scripts de automação e treinamento da equipe para garantir um fluxo de desenvolvimento mais integrado e eficiente.",
  "skills.docker.text": "Tenho experiência com Docker para conteinerização de aplicações, criação de ambientes isolados, utilização em testes automatizados e deploys de aplicações.",
  "skills.rabbitmq.text":  "Meu conhecimento em RabbitMQ se da em projetos próprios, onde explorei conceitos de mensageria assíncrona para comunicação entre serviços distribuídos. Trabalhei na configuração de exchanges, filas e consumers, garantindo a entrega eficiente de mensagens e a escalabilidade dos sistemas que desenvolvi.",
  "skills.springboot.text": "Possuo 5 anos de experiência profissional com Spring Boot, tendo atuado em diversos projetos, incluindo a reformulação do autenticador da empresa. Trabalhei na implementação de APIs RESTful, segurança com JWT e OAuth, integração com bancos de dados e mensageria, além de otimizações de desempenho para garantir escalabilidade e estabilidade.",
  "skills.extjs.text": "Tenho 6 anos de experiência profissional com ExtJS, onde fui responsável por migrações de versões da framework JavaScript e pela separação do frontend e backend em projetos distintos. Participei ativamente na modernização do stack da empresa, garantindo melhor manutenção do código e aprimorando a experiência do usuário.",
  "skills.grails.text": "Também possuo 6 anos de experiência profissional com Grails, tendo trabalhado em diversos projetos relevantes. Desenvolvi uma aplicação para execução de relatórios assíncronos, participei da migração de um monólito para microsserviços e liderei a reformulação geral de sistemas e da autenticação. Minha experiência inclui integrações complexas, otimizações de performance e aprimoramento da segurança das aplicações.",
  "skills.react.text": "Meu conhecimento em ReactJS foi adquirido em projetos pessoais, onde desenvolvi aplicações interativas e responsivas. Trabalhei com componentes reutilizáveis, gerenciamento de estado e integração com APIs REST, além de explorar conceitos como hooks e context API.",
  "skills.tailwind.text": "Utilizei Tailwind CSS em projetos pessoais para estilização eficiente e moderna de interfaces. Sua abordagem baseada em utilitários me permitiu criar layouts flexíveis e responsivos de maneira ágil, garantindo uma experiência visual consistente e adaptável.",
  "about.title": "Sobre mim",
  "about.text": "Sou um desenvolvedor fullstack com sólida experiência em Java e JavaScript, especializado no ecossistema Grails e Spring Boot, além de frameworks como ExtJS. Tenho um forte background em segurança da informação e desenvolvimento seguro, além de experiência com Docker, CI/CD, bancos de dados SQL e mensageria. Minha carreira é marcada por migrações complexas de sistemas, reestruturação de arquiteturas legadas e otimização de aplicações para maior escalabilidade e segurança.<1/><1/>Fui responsável pela padronização do uso do Git em uma empresa que trabalhei e pela migração de repositórios SVN para GitLab, modernizando o fluxo de versionamento e colaboração entre equipes. Além disso, liderei a migração de pipelines do Jenkins para GitLab CI/CD, otimizando a entrega contínua e aumentando a eficiência do desenvolvimento.<1/><1/>Tenho experiência de 6 anos com Grails, sendo peça-chave na reformulação completa de sistemas legados, na separação de backend e frontend em projetos distintos e na migração de um monólito para uma arquitetura baseada em microsserviços. Desenvolvi também uma plataforma para execução de relatórios assíncronos, garantindo escalabilidade e eficiência na geração de dados.<1/><1/>Na área de segurança, fui responsável pela reformulação completa da autenticação das aplicações da empresa, aplicando boas práticas para fortalecer a proteção dos sistemas.<1/><1/>Atualmente, estou expandindo meu portfólio com projetos envolvendo JWT, OAuth, Kafka, RabbitMQ, gRPC e outras tecnologias modernas, explorando soluções escaláveis, comunicação eficiente entre serviços e sistemas distribuídos de alto desempenho.<1/><1/>Sou apaixonado por desafios técnicos, engenharia de software e boas práticas de programação. Meu objetivo é desenvolver sistemas robustos, eficientes e seguros, alinhando desempenho, escalabilidade e segurança.<1/><1/>Abaixo, você pode encontrar links para meus perfis profissionais.",
  "contact.title": "Contato",
  "contact.text": "Se quiser entrar em contato comigo, ficarei feliz em conversar! Seja para oportunidades de trabalho, projetos freelance ou simplesmente para trocar ideias sobre tecnologia e desenvolvimento de software, estou à disposição.<1/><1/>Você pode me encontrar através dos links abaixo ou enviar uma mensagem diretamente. Responderei o mais rápido possível!",
  "contact.form.title": "Formulário de Contato",
  "contact.form.fullname.label": "Nome Completo",
  "contact.form.fullname.hint": "Nome Completo",
  "contact.form.email.label": "E-mail",
  "contact.form.email.hint": "E-mail",
  "contact.form.message.label": "Mensagem",
  "contact.form.message.hint": "Mensagem",
  "contact.form.submit.label": "Enviar",
  "contact.form.submit.hint": "Enviar",
  "footer.copyright": "João Gabriel Hartmann. Todos os direitos reservados.",
  "footer.using": "Desenvolvido com React e Tailwind CSS"
}
