{
  "navbar.item.1.label": "Home",
  "navbar.item.1.hint": "Home",
  "navbar.item.2.label": "Projetos",
  "navbar.item.2.hint": "Projetos",
  "navbar.item.3.label": "Habilidades",
  "navbar.item.3.hint": "Habilidades",
  "navbar.item.4.label": "Sobre",
  "navbar.item.4.hint": "Sobre",
  "navbar.item.5.label": "Contato",
  "navbar.item.5.hint": "Contato",
  "navbar.item.language.hint": "Trocar Idioma",
  "navbar.item.menu.hint": "Menu",
  "hero.item.1.label": "Oi, meu nome é João",
  "hero.title": "Desenvolvedor Fullstack",
  "hero.item.2.label": "Especialista em criar soluções digitais completas, desde interfaces intuitivas até sistemas robustos. Com 6 anos transformando desafios em código eficiente e experiências memoráveis.",
  "hero.button.1.text": "Veja meu trabalho",
  "hero.button.1.hint": "Veja meu trabalho",
  "hero.button.2.text": "Baixe o currículo",
  "hero.button.2.hint": "Baixe o currículo",
  "stats.item.1.label": "Anos de Experiência",
  "stats.item.2.label": "Anos de Estudo",
  "stats.item.3.label": "Certificados Obtidos",
  "stats.item.4.label": "Projetos Pessoais",
  "projects.title": "Projetos",
  "projects.text": "Abaixo é possível ver meus experimentos e soluções criadas além do ambiente corporativo. Cada projeto aqui representa uma oportunidade de aplicar tecnologias emergentes, testar boas práticas de desenvolvimento e resolver problemas do mundo real de forma inovadora.<1/><1/>Esses trabalhos refletem minha paixão por transformar ideias em código funcional. Todos estão disponíveis publicamente para colaboração e estudo.",
  "projects.button.1.hint": "Anterior",
  "projects.button.2.hint": "Próximo",
  "projects.modal.close.hint": "Fechar",
  "projects.modal.features.label": "Features",
  "projects.modal.viewCode.label": "Código Fonte",
  "projects.modal.viewDemo.label": "Live Demo",
  "projects.modal.technologies.label": "Tecnologias",
  "projects.modal.previous.hint": "Anterior",
  "projects.modal.next.hint": "Próximo",
  "projects.modal.goToImage.hint": "Ir para a imagem",
  "skills.title": "Habilidades",
  "skills.text": "Minhas competências são organizadas por especialidade, permitindo atuação estratégica em cada camada do desenvolvimento. Cada card detalha anos de experiência, complexidade de implementação e casos de uso real — e podem ser filtradas por tipo de habilidade (backend, frontend, etc.) para uma navegação personalizada.",
  "skills.tabs.item.1.label": "Todas",
  "skills.tabs.item.2.label": "Backend",
  "skills.tabs.item.3.label": "Frontend",
  "skills.tabs.item.4.label": "Banco de Dados",
  "skills.tabs.item.5.label": "Repositórios",
  "skills.tabs.item.6.label": "DevOps",
  "about.title": "Sobre mim",
  "about.text": "Sou um desenvolvedor fullstack com experiência em Java e JavaScript, especializado no ecossistema Grails e Spring Boot, e também em frameworks como ExtJS. Tenho um forte background em segurança da informação e práticas de desenvolvimento seguro, além de experiência com Docker, CI/CD, bancos de dados SQL e mensageria. Sempre busco aprimorar minhas habilidades e explorar novas tecnologias, com interesse especial em microsserviços, mensageria e soluções escaláveis.<1/><1/>Atualmente, estou expandindo meu portfólio com projetos envolvendo JWT, OAuth, Kafka, RabbitMQ, gRPC e outras tecnologias modernas. Tenho experiência tanto no desenvolvimento de aplicações corporativas quanto na criação de soluções voltadas para automação e eficiência.<1/><1/>Sou apaixonado por desafios técnicos, engenharia de software e boas práticas de programação. Meu objetivo é desenvolver sistemas robustos e eficientes, sempre alinhando desempenho e segurança.<1/><1/>Abaixo, você pode encontrar links para meus perfis profissionais.",
  "contact.title": "Contato",
  "contact.text": "Se quiser entrar em contato comigo, ficarei feliz em conversar! Seja para oportunidades de trabalho, projetos freelance ou simplesmente para trocar ideias sobre tecnologia e desenvolvimento de software, estou à disposição.<1/><1/>Você pode me encontrar através dos links abaixo ou enviar uma mensagem diretamente. Responderei o mais rápido possível!",
  "contact.form.title": "Formulário de Contato",
  "contact.form.fullname.label": "Nome Completo",
  "contact.form.fullname.hint": "Nome Completo",
  "contact.form.email.label": "E-mail",
  "contact.form.email.hint": "E-mail",
  "contact.form.message.label": "Mensagem",
  "contact.form.message.hint": "Mensagem",
  "contact.form.submit.label": "Enviar",
  "contact.form.submit.hint": "Enviar",
  "footer.copyright": "João Gabriel Hartmann. Todos os direitos reservados.",
  "footer.using": "Desenvolvido com React e Tailwind CSS"
}
